In [1]:
import numpy as np
import pandas as pd

In [2]:
newdf  = pd.DataFrame(np.random.rand(122,5),index=np.arange((122)))
newdf

            0         1         2         3         4
0    0.905435  0.411730  0.176727  0.203285  0.056655
1    0.986308  0.763358  0.903594  0.074555  0.011011
2    0.871664  0.984100  0.086060  0.754440  0.613317
3    0.370118  0.812857  0.411303  0.552472  0.737794
4    0.713317  0.846967  0.805840  0.289395  0.626556
..        ...       ...       ...       ...       ...
117  0.184739  0.150801  0.933105  0.820922  0.650680
118  0.326036  0.118012  0.682154  0.707762  0.792400
119  0.065956  0.463147  0.477189  0.716722  0.195647
120  0.251786  0.792755  0.715459  0.902733  0.769873
121  0.436183  0.168773  0.032908  0.848697  0.667105

[122 rows x 5 columns]

In [3]:
newdf.columns = list("ABCDE")
newdf.head(2)

          A         B         C         D         E
0  0.905435  0.411730  0.176727  0.203285  0.056655
1  0.986308  0.763358  0.903594  0.074555  0.011011

In [6]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.1)]
newdf.head(5)

          A         B         C         D         E
0  0.905435  0.411730  0.176727  0.203285  0.056655
1  0.986308  0.763358  0.903594  0.074555  0.011011
2  0.871664  0.984100  0.086060  0.754440  0.613317
3  0.370118  0.812857  0.411303  0.552472  0.737794
4  0.713317  0.846967  0.805840  0.289395  0.626556

In [7]:
#usage of iLoc
newdf.head(3)

          A         B         C         D         E
0  0.905435  0.411730  0.176727  0.203285  0.056655
1  0.986308  0.763358  0.903594  0.074555  0.011011
2  0.871664  0.984100  0.086060  0.754440  0.613317

In [9]:
newdf.iloc[0,4]

np.float64(0.05665480655424526)

In [10]:
newdf.iloc[[0,5],[1,2]]

          B         C
0  0.411730  0.176727
5  0.303536  0.154561

In [11]:
 df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                             pd.NaT]})

In [12]:
df.head(3)

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [14]:
df.dropna()
df.dropna(how= "all")

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [17]:
df.shape

(3, 3)

In [18]:
df.info

<bound method DataFrame.info of        name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT>

In [20]:
df['toy'].value_counts(dropna=False)

toy
NaN          1
Batmobile    1
Bullwhip     1
Name: count, dtype: int64

In [21]:
df.isnull()

    name    toy   born
0  False   True   True
1  False  False  False
2  False  False   True